# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'homebrew/php'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

# Install more recent versions of some macOS tools
brew 'homebrew/dupes/grep'

# Install Binaries
brew 'awscli'
brew 'git'
brew 'hub'
brew 'tree'
brew 'mackup'
brew 'mas'
brew 'node'
brew 'trash'
brew 'wget'

# Development
brew 'mariadb'


# Apps
cask 'alfred'
cask 'caffeine'
cask 'docker'
cask 'opera'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'gpgtools'
cask 'mysqlworkbench'
cask 'sequel-pro'
cask 'visual-studio-code'
cask 'evernote'
cask 'filezilla'
cask 'torbrowser'
cask 'vlc'
cask 'anaconda'

# Fonts
cask 'font-sauce-code-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Install Mac App Store apps
mas 'Sketch', id: 402476602
mas 'Tweetbot', id: 557168941