# VS Code Extensions
# Based on your development setup

# Language Support
ms-python.python
ms-python.flake8
ms-python.black-formatter
ms-python.pylint
ms-toolsai.jupyter
bradlc.vscode-tailwindcss
ms-vscode.vscode-typescript-next
formulahendry.auto-rename-tag
christian-kohler.path-intellisense

# Git & Version Control
eamodio.gitlens
github.vscode-pull-request-github
github.copilot
github.copilot-chat

# Docker & DevOps
ms-azuretools.vscode-docker
ms-kubernetes-tools.vscode-kubernetes-tools
ms-vscode-remote.remote-containers

# Database
ms-mssql.mssql
cweijan.vscode-postgresql-client2

# Productivity
ms-vscode.vscode-json
redhat.vscode-yaml
yzhang.markdown-all-in-one
shd101wyy.markdown-preview-enhanced
streetsidesoftware.code-spell-checker

# UI & Themes
pkief.material-icon-theme
github.github-vscode-theme
dracula-theme.theme-dracula

# Formatters & Linters
esbenp.prettier-vscode
ms-vscode.vscode-eslint
davidanson.vscode-markdownlint

# Utilities
alefragnani.bookmarks
formulahendry.code-runner
ms-vscode.hexeditor
